rule gcp_service_account_usage_suspicious_geolocation {
  meta:
    author = "Gowthaman"
    description = "Detects service account usage (e.g., login, create, update activities) originating from a country/region that is not in the corporate allow-list."
    severity = "HIGH"
    
  events:
   ( 
    $sa_activity.metadata.event_type = "USER_LOGIN" or 
    $sa_activity.metadata.event_type = "RESOURCE_READ" or
    $sa_activity.metadata.event_type = "RESOURCE_CREATION" or
    $sa_activity.metadata.event_type = "RESOURCE_WRITTEN" or
    $sa_activity.metadata.event_type = "RESOURCE_DELETION" or
    $sa_activity.metadata.event_type = "USER_UNCATEGORIZED" or
    $sa_activity.metadata.event_type = "USER_RESOURCE_UPDATE_PERMISSIONS" or
    $sa_activity.metadata.event_type = "USER_RESOURCE_CREATION" or
    $sa_activity.metadata.event_type = "USER_RESOURCE_UPDATE_CONTENT" or
    $sa_activity.metadata.event_type = "SERVICE_UNSPECIFIED" or
    $sa_activity.metadata.event_type = "STATUS_UPDATE" or
    $sa_activity.metadata.event_type = "USER_CREATION" or
    $sa_activity.metadata.event_type = "USER_CHANGE_PASSWORD" or
    $sa_activity.metadata.event_type = "GENERIC_EVENT" or
    $sa_activity.metadata.event_type = "USER_DELETION" or
    $sa_activity.metadata.event_type = "USER_RESOURCE_DELETION" 
    )

    $sa_activity.principal.location.country_or_region in %dh_login_restricted_countries 
    $sa_activity.principal.user.userid = /@.*\.gserviceaccount\.com$/ nocase
    $sa_activity.security_result.action = "ALLOW"

  outcome:
    $risk_score = max(70) 
    $service_account_id = $sa_activity.principal.user.userid
    $network_http_user_agent = $sa_activity.network.http.user_agent
    $principal_ip = array_distinct($sa_activity.principal.ip)
    $external_country = array_distinct($sa_activity.principal.location.country_or_region)
    $principal_ip_state = array_distinct($sa_activity.principal.ip_geo_artifact.location.state)
    $service_account_userid  = $sa_activity.principal.user.userid
    $target_hostname = array_distinct($sa_activity.target.hostname)
    $activity_type = $sa_activity.metadata.event_type
    $timestamp = $sa_activity.metadata.event_timestamp.seconds


  condition:
    $sa_activity
}
